MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKW38A512VFT4/mcu.h
/* PORT - Peripheral instance base addresses */
/** Peripheral PORTA base address */
#define PORTA_BASE                               (0x40049000u)
/** Peripheral PORTA base pointer */
#define PORTA                                    ((PORT_Type *)PORTA_BASE)
/** Peripheral PORTB base address */
#define PORTB_BASE                               (0x4004A000u)
/** Peripheral PORTB base pointer */
#define PORTB                                    ((PORT_Type *)PORTB_BASE)
/** Peripheral PORTC base address */
#define PORTC_BASE                               (0x4004B000u)
/** Peripheral PORTC base pointer */
#define PORTC                                    ((PORT_Type *)PORTC_BASE)
/** Array initializer of PORT peripheral base addresses */
#define PORT_BASE_ADDRS                          { PORTA_BASE, PORTB_BASE, PORTC_BASE }
/** Array initializer of PORT peripheral base pointers */
#define PORT_BASE_PTRS                           { PORTA, PORTB, PORTC }
/** Interrupt vectors for the PORT peripheral type */
#define PORT_IRQS                                { PORTA_IRQn, PORTB_PORTC_IRQn, PORTB_PORTC_IRQn }

/*!
 * @}
 */ /* end of group PORT_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RADIO_CTRL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RADIO_CTRL_Peripheral_Access_Layer RADIO_CTRL Peripheral Access Layer
 * @{
 */

/** RADIO_CTRL - Register Layout Typedef */
typedef struct {
  __I  uint32_t LL_STATUS;                         /**< Radio LL STATUS, offset: 0x0 */
  __IO uint32_t LL_CTRL;                           /**< Radio control register, offset: 0x4 */
  __IO uint32_t PACKET_RAM_CTRL;                   /**< PACKET_RAM_CTRL register, offset: 0x8 */
  __IO uint32_t RF_CTRL_OVRD;                      /**< Radio Control Override Register, offset: 0xC */
} RADIO_CTRL_Type;

/* ----------------------------------------------------------------------------
   -- RADIO_CTRL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RADIO_CTRL_Register_Masks RADIO_CTRL Register Masks
 * @{
 */

/*! @name LL_STATUS - Radio LL STATUS */
/*! @{ */
#define RADIO_CTRL_LL_STATUS_LL_PRESENT_MASK     (0x3FU)
#define RADIO_CTRL_LL_STATUS_LL_PRESENT_SHIFT    (0U)
/*! LL_PRESENT - Link Layer (LL) present status
 */
#define RADIO_CTRL_LL_STATUS_LL_PRESENT(x)       (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_LL_STATUS_LL_PRESENT_SHIFT)) & RADIO_CTRL_LL_STATUS_LL_PRESENT_MASK)
/*! @} */

/*! @name LL_CTRL - Radio control register */
/*! @{ */
#define RADIO_CTRL_LL_CTRL_ACTIVE_LL_MASK        (0x3U)
#define RADIO_CTRL_LL_CTRL_ACTIVE_LL_SHIFT       (0U)
/*! ACTIVE_LL - Link layer select register
 *  0b00..Bluetooth LE LL is selected
 *  0b01..Reserved
 *  0b10..GENERIC LL is selected
 *  0b11..Disabled (default)
 */
#define RADIO_CTRL_LL_CTRL_ACTIVE_LL(x)          (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_LL_CTRL_ACTIVE_LL_SHIFT)) & RADIO_CTRL_LL_CTRL_ACTIVE_LL_MASK)
/*! @} */

/*! @name PACKET_RAM_CTRL - PACKET_RAM_CTRL register */
/*! @{ */
#define RADIO_CTRL_PACKET_RAM_CTRL_PB_PROTECT_MASK (0x1U)
#define RADIO_CTRL_PACKET_RAM_CTRL_PB_PROTECT_SHIFT (0U)
/*! PB_PROTECT - PB_PROTECT
 *  0b0..Incoming receive data can overwrite the existing contents of the RX section of the Packet Buffer.
 *  0b1..Incoming receive data is been blocked from overwriting the existing contents of the RX section of the Packet Buffer.
 */
#define RADIO_CTRL_PACKET_RAM_CTRL_PB_PROTECT(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_CTRL_PB_PROTECT_SHIFT)) & RADIO_CTRL_PACKET_RAM_CTRL_PB_PROTECT_MASK)
#define RADIO_CTRL_PACKET_RAM_CTRL_RAM_IPS_WAIT_DISABLE_MASK (0x2U)
#define RADIO_CTRL_PACKET_RAM_CTRL_RAM_IPS_WAIT_DISABLE_SHIFT (1U)
/*! RAM_IPS_WAIT_DISABLE - RAM_IPS_WAIT_DISABLE
 *  0b0..ips_xfr_wait is asserted when LL is accessing packet RAM
 *  0b1..ips_xfr_wait is not asserted when LL is accessing packet RAM
 */
#define RADIO_CTRL_PACKET_RAM_CTRL_RAM_IPS_WAIT_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_CTRL_RAM_IPS_WAIT_DISABLE_SHIFT)) & RADIO_CTRL_PACKET_RAM_CTRL_RAM_IPS_WAIT_DISABLE_MASK)
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CLK_ON_OVRD_EN_MASK (0x10U)
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CLK_ON_OVRD_EN_SHIFT (4U)
/*! RX_RAM_CLK_ON_OVRD_EN - Override control for RX_RAM Clock Gate Enable
 *  0b0..Normal operation.
 *  0b1..Use the state of RX_RAM_CLK_ON_OVRD_EN to override the RAM Clock Gate Enable.
 */
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CLK_ON_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CLK_ON_OVRD_EN_SHIFT)) & RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CLK_ON_OVRD_EN_MASK)
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CLK_ON_OVRD_MASK (0x20U)
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CLK_ON_OVRD_SHIFT (5U)
/*! RX_RAM_CLK_ON_OVRD - Override value for RX_RAM Clock Gate Enable
 */
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CLK_ON_OVRD(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CLK_ON_OVRD_SHIFT)) & RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CLK_ON_OVRD_MASK)
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CE_ON_OVRD_EN_MASK (0x40U)
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CE_ON_OVRD_EN_SHIFT (6U)
/*! RX_RAM_CE_ON_OVRD_EN - Override control for RX RAM CE
 *  0b0..Normal operation.
 *  0b1..Use the state of RX_RAM_CE_ON_OVRD to override the RX RAM CE.
 */
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CE_ON_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CE_ON_OVRD_EN_SHIFT)) & RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CE_ON_OVRD_EN_MASK)
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CE_ON_OVRD_MASK (0x80U)
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CE_ON_OVRD_SHIFT (7U)
/*! RX_RAM_CE_ON_OVRD - Override value for RAM CE
 */
#define RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CE_ON_OVRD(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CE_ON_OVRD_SHIFT)) & RADIO_CTRL_PACKET_RAM_CTRL_RX_RAM_CE_ON_OVRD_MASK)
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CLK_ON_OVRD_EN_MASK (0x100U)
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CLK_ON_OVRD_EN_SHIFT (8U)
/*! TX_RAM_CLK_ON_OVRD_EN - Override control for TX_RAM1 Clock Gate Enable
 *  0b0..Normal operation.
 *  0b1..Use the state of TX_RAM1_CLK_ON_OVRD_EN to override the TX RAM1 Clock Gate Enable.
 */
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CLK_ON_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CLK_ON_OVRD_EN_SHIFT)) & RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CLK_ON_OVRD_EN_MASK)
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CLK_ON_OVRD_MASK (0x200U)
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CLK_ON_OVRD_SHIFT (9U)
/*! TX_RAM_CLK_ON_OVRD - Override value for RAM Clock Gate Enable
 */
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CLK_ON_OVRD(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CLK_ON_OVRD_SHIFT)) & RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CLK_ON_OVRD_MASK)
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CE_ON_OVRD_EN_MASK (0x400U)
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CE_ON_OVRD_EN_SHIFT (10U)
/*! TX_RAM_CE_ON_OVRD_EN - Override control for RAM CE
 *  0b0..Normal operation.
 *  0b1..Use the state of TX_RAM_CE_ON_OVRD_EN to override the RAM CE.
 */
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CE_ON_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CE_ON_OVRD_EN_SHIFT)) & RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CE_ON_OVRD_EN_MASK)
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CE_ON_OVRD_MASK (0x800U)
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CE_ON_OVRD_SHIFT (11U)
/*! TX_RAM_CE_ON_OVRD - Override value for RAM CE (Chip Enable)
 */
#define RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CE_ON_OVRD(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CE_ON_OVRD_SHIFT)) & RADIO_CTRL_PACKET_RAM_CTRL_TX_RAM_CE_ON_OVRD_MASK)
/*! @} */

/*! @name RF_CTRL_OVRD - Radio Control Override Register */
/*! @{ */
#define RADIO_CTRL_RF_CTRL_OVRD_RBME_MODE_OVRD_EN_MASK (0x1U)
#define RADIO_CTRL_RF_CTRL_OVRD_RBME_MODE_OVRD_EN_SHIFT (0U)
/*! RBME_MODE_OVRD_EN - RBME Mode Override Enable
 *  0b0..RBME Mode Override Disable
 *  0b1..RBME Mode Override Enable
 */
#define RADIO_CTRL_RF_CTRL_OVRD_RBME_MODE_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_CTRL_OVRD_RBME_MODE_OVRD_EN_SHIFT)) & RADIO_CTRL_RF_CTRL_OVRD_RBME_MODE_OVRD_EN_MASK)
#define RADIO_CTRL_RF_CTRL_OVRD_RBME_MODE_OVRD_MASK (0xEU)
#define RADIO_CTRL_RF_CTRL_OVRD_RBME_MODE_OVRD_SHIFT (1U)
/*! RBME_MODE_OVRD - RBME Mode Override
 */
#define RADIO_CTRL_RF_CTRL_OVRD_RBME_MODE_OVRD(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_CTRL_OVRD_RBME_MODE_OVRD_SHIFT)) & RADIO_CTRL_RF_CTRL_OVRD_RBME_MODE_OVRD_MASK)
#define RADIO_CTRL_RF_CTRL_OVRD_RX_CON_EN_OVRD_EN_MASK (0x10U)
#define RADIO_CTRL_RF_CTRL_OVRD_RX_CON_EN_OVRD_EN_SHIFT (4U)
/*! RX_CON_EN_OVRD_EN - rx_con_en Override Enable
 *  0b0..rx_con_en Override Disable
 *  0b1..rx_con_en Override Enable
 */
#define RADIO_CTRL_RF_CTRL_OVRD_RX_CON_EN_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_CTRL_OVRD_RX_CON_EN_OVRD_EN_SHIFT)) & RADIO_CTRL_RF_CTRL_OVRD_RX_CON_EN_OVRD_EN_MASK)
#define RADIO_CTRL_RF_CTRL_OVRD_RX_CON_EN_OVRD_MASK (0x20U)
#define RADIO_CTRL_RF_CTRL_OVRD_RX_CON_EN_OVRD_SHIFT (5U)
/*! RX_CON_EN_OVRD - rx_con_en Override
 */
#define RADIO_CTRL_RF_CTRL_OVRD_RX_CON_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_CTRL_OVRD_RX_CON_EN_OVRD_SHIFT)) & RADIO_CTRL_RF_CTRL_OVRD_RX_CON_EN_OVRD_MASK)
#define RADIO_CTRL_RF_CTRL_OVRD_BLE_LR_EN_OVRD_EN_MASK (0x40U)
#define RADIO_CTRL_RF_CTRL_OVRD_BLE_LR_EN_OVRD_EN_SHIFT (6U)
/*! BLE_LR_EN_OVRD_EN - ble_lr_en Override Enable
 *  0b0..ble_lr_en Override Disable
 *  0b1..ble_lr_en Override Enable
 */
#define RADIO_CTRL_RF_CTRL_OVRD_BLE_LR_EN_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_CTRL_OVRD_BLE_LR_EN_OVRD_EN_SHIFT)) & RADIO_CTRL_RF_CTRL_OVRD_BLE_LR_EN_OVRD_EN_MASK)
#define RADIO_CTRL_RF_CTRL_OVRD_BLE_LR_EN_OVRD_MASK (0x80U)
#define RADIO_CTRL_RF_CTRL_OVRD_BLE_LR_EN_OVRD_SHIFT (7U)
/*! BLE_LR_EN_OVRD - ble_lr_en Override
 */
#define RADIO_CTRL_RF_CTRL_OVRD_BLE_LR_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_CTRL_OVRD_BLE_LR_EN_OVRD_SHIFT)) & RADIO_CTRL_RF_CTRL_OVRD_BLE_LR_EN_OVRD_MASK)
#define RADIO_CTRL_RF_CTRL_OVRD_RIF_SEL_2MBPS_OVRD_EN_MASK (0x100U)
#define RADIO_CTRL_RF_CTRL_OVRD_RIF_SEL_2MBPS_OVRD_EN_SHIFT (8U)
/*! RIF_SEL_2MBPS_OVRD_EN - rif_sel_2mbps Override Enable
 *  0b0..rif_sel_2mbps Override Disable
 *  0b1..rif_sel_2mbps Override Enable
 */
#define RADIO_CTRL_RF_CTRL_OVRD_RIF_SEL_2MBPS_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_CTRL_OVRD_RIF_SEL_2MBPS_OVRD_EN_SHIFT)) & RADIO_CTRL_RF_CTRL_OVRD_RIF_SEL_2MBPS_OVRD_EN_MASK)
#define RADIO_CTRL_RF_CTRL_OVRD_RIF_SEL_2MBPS_OVRD_MASK (0x200U)
#define RADIO_CTRL_RF_CTRL_OVRD_RIF_SEL_2MBPS_OVRD_SHIFT (9U)
/*! RIF_SEL_2MBPS_OVRD - rif_sel_2mbps Override
 */
#define RADIO_CTRL_RF_CTRL_OVRD_RIF_SEL_2MBPS_OVRD(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_CTRL_OVRD_RIF_SEL_2MBPS_OVRD_SHIFT)) & RADIO_CTRL_RF_CTRL_OVRD_RIF_SEL_2MBPS_OVRD_MASK)
#define RADIO_CTRL_RF_CTRL_OVRD_RBME_CLK_EN_OVRD_MASK (0x10000U)
#define RADIO_CTRL_RF_CTRL_OVRD_RBME_CLK_EN_OVRD_SHIFT (16U)
/*! RBME_CLK_EN_OVRD - RBME Clock Enable Override
 *  0b0..RBME clock force on is disabled.
 *  0b1..RBME clock force on is enabled.
 */
#define RADIO_CTRL_RF_CTRL_OVRD_RBME_CLK_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_CTRL_OVRD_RBME_CLK_EN_OVRD_SHIFT)) & RADIO_CTRL_RF_CTRL_OVRD_RBME_CLK_EN_OVRD_MASK)
#define RADIO_CTRL_RF_CTRL_OVRD_BTLL_CLK_EN_OVRD_MASK (0x20000U)
#define RADIO_CTRL_RF_CTRL_OVRD_BTLL_CLK_EN_OVRD_SHIFT (17U)
/*! BTLL_CLK_EN_OVRD - BTLL Clock Enable Override
 *  0b0..BTLL clock force on is disabled.
 *  0b1..BTLL clock force on is enabled.
 */
#define RADIO_CTRL_RF_CTRL_OVRD_BTLL_CLK_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_CTRL_OVRD_BTLL_CLK_EN_OVRD_SHIFT)) & RADIO_CTRL_RF_CTRL_OVRD_BTLL_CLK_EN_OVRD_MASK)
#define RADIO_CTRL_RF_CTRL_OVRD_GENLL_CLK_EN_OVRD_MASK (0x40000U)
#define RADIO_CTRL_RF_CTRL_OVRD_GENLL_CLK_EN_OVRD_SHIFT (18U)
/*! GENLL_CLK_EN_OVRD - GENLL Clock Enable Override
 *  0b0..GENLL clock force on is disabled.
 *  0b1..GENLL clock force on is enabled.
 */
#define RADIO_CTRL_RF_CTRL_OVRD_GENLL_CLK_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << RADIO_CTRL_RF_CTRL_OVRD_GENLL_CLK_EN_OVRD_SHIFT)) & RADIO_CTRL_RF_CTRL_OVRD_GENLL_CLK_EN_OVRD_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group RADIO_CTRL_Register_Masks */


/* RADIO_CTRL - Peripheral instance base addresses */
/** Peripheral RADIO_CTRL base address */
#define RADIO_CTRL_BASE                          (0x40086000u)
/** Peripheral RADIO_CTRL base pointer */
#define RADIO_CTRL                               ((RADIO_CTRL_Type *)RADIO_CTRL_BASE)
/** Array initializer of RADIO_CTRL peripheral base addresses */
#define RADIO_CTRL_BASE_ADDRS                    { RADIO_CTRL_BASE }
/** Array initializer of RADIO_CTRL peripheral base pointers */
#define RADIO_CTRL_BASE_PTRS                     { RADIO_CTRL }

/*!
 * @}
 */ /* end of group RADIO_CTRL_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RBME Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RBME_Peripheral_Access_Layer RBME Peripheral Access Layer
 * @{
 */

/** RBME - Register Layout Typedef */
typedef struct {
  __IO uint32_t CRCW_CFG;                          /**< CRC/WHITENER CONFIG REGISTER, offset: 0x0 */
  __I  uint32_t CRC_EC_MASK;                       /**< CRC ERROR CORRECTION MASK, offset: 0x4 */
  __I  uint32_t CRC_RES_OUT;                       /**< CRC RESULT, offset: 0x8 */
  __IO uint32_t CRCW_CFG2;                         /**< CRC/WHITENER CONFIG 2 REGISTER, offset: 0xC */
  __IO uint32_t CRCW_CFG3;                         /**< CRC CONFIGURATION, offset: 0x10 */
  __IO uint32_t CRC_INIT;                          /**< CRC INITIALIZATION, offset: 0x14 */
  __IO uint32_t CRC_POLY;                          /**< CRC POLYNOMIAL, offset: 0x18 */
  __IO uint32_t CRC_XOR_OUT;                       /**< CRC XOR OUT, offset: 0x1C */
  __IO uint32_t WHITEN_CFG;                        /**< WHITENER CONFIGURATION, offset: 0x20 */
  __IO uint32_t WHITEN_POLY;                       /**< WHITENER POLYNOMIAL, offset: 0x24 */
  __IO uint32_t WHITEN_SZ_THR;                     /**< WHITENER SIZE THRESHOLD, offset: 0x28 */
  __IO uint32_t FEC_CFG1;                          /**< FEC CONFIG REGISTER 1, offset: 0x2C */
  __IO uint32_t RBME_RST;                          /**< RBME SOFT RESET REGISTER, offset: 0x30 */
  __IO uint32_t FEC_CFG2;                          /**< FEC CONFIG REGISTER 2, offset: 0x34 */
  __IO uint32_t FLUSH_CFG;                         /**< FEC FLUSH CONFIG REGISTER, offset: 0x38 */
  __IO uint32_t SPREAD_CFG;                        /**< SPREADER CONFIG REGISTER, offset: 0x3C */
  __IO uint32_t WHT_CFG;                           /**< WHITEN CONFIG REGISTER, offset: 0x40 */
  __IO uint32_t PKT_SZ;                            /**< PACKET SIZE REGISTER, offset: 0x44 */
  __IO uint32_t CRC_PHR_SZ;                        /**< LENGTH OF PHR CONFIG REGISTER, offset: 0x48 */
  __IO uint32_t FCP_CFG;                           /**< FCP SUPPORT CONFIG REGISTER, offset: 0x4C */
  __IO uint32_t FRAME_OVER_SZ;                     /**< FRAME OVERRIDE SIZE REGISTER, offset: 0x50 */
  __IO uint32_t FEC_BSZ_OV_B4SP;                   /**< OVERRIDE OF FEC BLOCK SIZE REGISTER, offset: 0x54 */
  __IO uint32_t LEG0_CFG;                          /**< LEG0 CONFIG REGISTER, offset: 0x58 */
  __IO uint32_t NPAYL_OVER_SZ;                     /**< OVERRIDE PAYLOAD LENGTH REGISTER, offset: 0x5C */
  __IO uint32_t DATALL_CFG;                        /**< DATA TO LINK LAYER CONFIG REGISTER, offset: 0x60 */
  __IO uint32_t RAM_S_ADDR;                        /**< PACKET RAM SOURCE ADDRESS, offset: 0x64 */
  __IO uint32_t RAM_D_ADDR;                        /**< PACKET RAM DESTINATION ADDRESS, offset: 0x68 */
  __IO uint32_t RAM_IF_CFG;                        /**< PACKET RAM INTERFACE CONFIG REGISTER, offset: 0x6C */
} RBME_Type;

/* ----------------------------------------------------------------------------
   -- RBME Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RBME_Register_Masks RBME Register Masks
 * @{
 */

/*! @name CRCW_CFG - CRC/WHITENER CONFIG REGISTER */
/*! @{ */
#define RBME_CRCW_CFG_CRCW_EN_MASK               (0x1U)
#define RBME_CRCW_CFG_CRCW_EN_SHIFT              (0U)
/*! CRCW_EN - CRC calculation enable
 */
#define RBME_CRCW_CFG_CRCW_EN(x)                 (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG_CRCW_EN_SHIFT)) & RBME_CRCW_CFG_CRCW_EN_MASK)
#define RBME_CRCW_CFG_CRCW_EC_EN_MASK            (0x2U)
#define RBME_CRCW_CFG_CRCW_EC_EN_SHIFT           (1U)
/*! CRCW_EC_EN - CRC Error Correction Enable
 */
#define RBME_CRCW_CFG_CRCW_EC_EN(x)              (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG_CRCW_EC_EN_SHIFT)) & RBME_CRCW_CFG_CRCW_EC_EN_MASK)
#define RBME_CRCW_CFG_CRC_ZERO_MASK              (0x4U)
#define RBME_CRCW_CFG_CRC_ZERO_SHIFT             (2U)
/*! CRC_ZERO - CRC zero
 */
#define RBME_CRCW_CFG_CRC_ZERO(x)                (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG_CRC_ZERO_SHIFT)) & RBME_CRCW_CFG_CRC_ZERO_MASK)
#define RBME_CRCW_CFG_CRC_EARLY_FAIL_MASK        (0x8U)
#define RBME_CRCW_CFG_CRC_EARLY_FAIL_SHIFT       (3U)
/*! CRC_EARLY_FAIL - CRC error correction fail
 */
#define RBME_CRCW_CFG_CRC_EARLY_FAIL(x)          (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG_CRC_EARLY_FAIL_SHIFT)) & RBME_CRCW_CFG_CRC_EARLY_FAIL_MASK)
#define RBME_CRCW_CFG_CRC_RES_OUT_VLD_MASK       (0x10U)
#define RBME_CRCW_CFG_CRC_RES_OUT_VLD_SHIFT      (4U)
/*! CRC_RES_OUT_VLD - CRC result output valid
 */
#define RBME_CRCW_CFG_CRC_RES_OUT_VLD(x)         (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG_CRC_RES_OUT_VLD_SHIFT)) & RBME_CRCW_CFG_CRC_RES_OUT_VLD_MASK)
#define RBME_CRCW_CFG_CRC_EC_OFFSET_MASK         (0x7FF0000U)
#define RBME_CRCW_CFG_CRC_EC_OFFSET_SHIFT        (16U)
/*! CRC_EC_OFFSET - CRC error correction offset
 */
#define RBME_CRCW_CFG_CRC_EC_OFFSET(x)           (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG_CRC_EC_OFFSET_SHIFT)) & RBME_CRCW_CFG_CRC_EC_OFFSET_MASK)
#define RBME_CRCW_CFG_CRC_EC_DONE_MASK           (0x10000000U)
#define RBME_CRCW_CFG_CRC_EC_DONE_SHIFT          (28U)
/*! CRC_EC_DONE - CRC error correction done
 */
#define RBME_CRCW_CFG_CRC_EC_DONE(x)             (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG_CRC_EC_DONE_SHIFT)) & RBME_CRCW_CFG_CRC_EC_DONE_MASK)
#define RBME_CRCW_CFG_CRC_EC_FAIL_MASK           (0x20000000U)
#define RBME_CRCW_CFG_CRC_EC_FAIL_SHIFT          (29U)
/*! CRC_EC_FAIL - CRC error correction fail
 */
#define RBME_CRCW_CFG_CRC_EC_FAIL(x)             (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG_CRC_EC_FAIL_SHIFT)) & RBME_CRCW_CFG_CRC_EC_FAIL_MASK)
/*! @} */

/*! @name CRC_EC_MASK - CRC ERROR CORRECTION MASK */
/*! @{ */
#define RBME_CRC_EC_MASK_CRC_EC_MASK_MASK        (0xFFFFFFFFU)
#define RBME_CRC_EC_MASK_CRC_EC_MASK_SHIFT       (0U)
/*! CRC_EC_MASK - CRC error correction mask
 */
#define RBME_CRC_EC_MASK_CRC_EC_MASK(x)          (((uint32_t)(((uint32_t)(x)) << RBME_CRC_EC_MASK_CRC_EC_MASK_SHIFT)) & RBME_CRC_EC_MASK_CRC_EC_MASK_MASK)
/*! @} */

/*! @name CRC_RES_OUT - CRC RESULT */
/*! @{ */
#define RBME_CRC_RES_OUT_CRC_RES_OUT_MASK        (0xFFFFFFFFU)
#define RBME_CRC_RES_OUT_CRC_RES_OUT_SHIFT       (0U)
/*! CRC_RES_OUT - CRC result output
 */
#define RBME_CRC_RES_OUT_CRC_RES_OUT(x)          (((uint32_t)(((uint32_t)(x)) << RBME_CRC_RES_OUT_CRC_RES_OUT_SHIFT)) & RBME_CRC_RES_OUT_CRC_RES_OUT_MASK)
/*! @} */

/*! @name CRCW_CFG2 - CRC/WHITENER CONFIG 2 REGISTER */
/*! @{ */
#define RBME_CRCW_CFG2_CRC_EC_SPKT_BYTES_MASK    (0xFFU)
#define RBME_CRCW_CFG2_CRC_EC_SPKT_BYTES_SHIFT   (0U)
/*! CRC_EC_SPKT_BYTES - Error Correction Short Packet Bytes
 */
#define RBME_CRCW_CFG2_CRC_EC_SPKT_BYTES(x)      (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG2_CRC_EC_SPKT_BYTES_SHIFT)) & RBME_CRCW_CFG2_CRC_EC_SPKT_BYTES_MASK)
#define RBME_CRCW_CFG2_CRC_EC_SPKT_WND_MASK      (0xF00U)
#define RBME_CRCW_CFG2_CRC_EC_SPKT_WND_SHIFT     (8U)
/*! CRC_EC_SPKT_WND - Error correction short packet burst error window
 */
#define RBME_CRCW_CFG2_CRC_EC_SPKT_WND(x)        (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG2_CRC_EC_SPKT_WND_SHIFT)) & RBME_CRCW_CFG2_CRC_EC_SPKT_WND_MASK)
#define RBME_CRCW_CFG2_CRC_EC_LPKT_WND_MASK      (0xF000U)
#define RBME_CRCW_CFG2_CRC_EC_LPKT_WND_SHIFT     (12U)
/*! CRC_EC_LPKT_WND - Error correction long packet burst error window
 */
#define RBME_CRCW_CFG2_CRC_EC_LPKT_WND(x)        (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG2_CRC_EC_LPKT_WND_SHIFT)) & RBME_CRCW_CFG2_CRC_EC_LPKT_WND_MASK)
/*! @} */

/*! @name CRCW_CFG3 - CRC CONFIGURATION */
/*! @{ */
#define RBME_CRCW_CFG3_CRC_SZ_MASK               (0x7U)
#define RBME_CRCW_CFG3_CRC_SZ_SHIFT              (0U)
/*! CRC_SZ - CRC Size (in octets)
 */
#define RBME_CRCW_CFG3_CRC_SZ(x)                 (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG3_CRC_SZ_SHIFT)) & RBME_CRCW_CFG3_CRC_SZ_MASK)
#define RBME_CRCW_CFG3_CRC_START_BYTE_MASK       (0xF00U)
#define RBME_CRCW_CFG3_CRC_START_BYTE_SHIFT      (8U)
/*! CRC_START_BYTE - Configure CRC Start Point
 */
#define RBME_CRCW_CFG3_CRC_START_BYTE(x)         (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG3_CRC_START_BYTE_SHIFT)) & RBME_CRCW_CFG3_CRC_START_BYTE_MASK)
#define RBME_CRCW_CFG3_CRC_REF_IN_MASK           (0x10000U)
#define RBME_CRCW_CFG3_CRC_REF_IN_SHIFT          (16U)
/*! CRC_REF_IN - CRC Reflect In
 *  0b0..Does not manipulate input data stream
 *  0b1..reflect each byte in the input stream bitwise
 */
#define RBME_CRCW_CFG3_CRC_REF_IN(x)             (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG3_CRC_REF_IN_SHIFT)) & RBME_CRCW_CFG3_CRC_REF_IN_MASK)
#define RBME_CRCW_CFG3_CRC_REF_OUT_MASK          (0x20000U)
#define RBME_CRCW_CFG3_CRC_REF_OUT_SHIFT         (17U)
/*! CRC_REF_OUT - CRC Reflect Out
 *  0b0..Does not manipulate CRC result
 *  0b1..CRC result is to be reflected bitwise (operated on entire word)
 */
#define RBME_CRCW_CFG3_CRC_REF_OUT(x)            (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG3_CRC_REF_OUT_SHIFT)) & RBME_CRCW_CFG3_CRC_REF_OUT_MASK)
#define RBME_CRCW_CFG3_CRC_BYTE_ORD_MASK         (0x40000U)
#define RBME_CRCW_CFG3_CRC_BYTE_ORD_SHIFT        (18U)
/*! CRC_BYTE_ORD - CRC Byte Order
 *  0b0..LS Byte First
 *  0b1..MS Byte First
 */
#define RBME_CRCW_CFG3_CRC_BYTE_ORD(x)           (((uint32_t)(((uint32_t)(x)) << RBME_CRCW_CFG3_CRC_BYTE_ORD_SHIFT)) & RBME_CRCW_CFG3_CRC_BYTE_ORD_MASK)
/*! @} */

