MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKW38A512VFT4/mcu.h
/*! @name FSK_PT - PHY Uncoded Power Threshold Config */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_PT_AGC_TIMEOUT_MASK  (0xFFFFU)
#define XCVR_2P4GHZ_PHY_FSK_PT_AGC_TIMEOUT_SHIFT (0U)
/*! AGC_TIMEOUT - Time-out, applicable to special conditioning of signal power detection in the
 *    Power threshold block, after each AGC gain adjustment. It is expressed in number of samples.
 */
#define XCVR_2P4GHZ_PHY_FSK_PT_AGC_TIMEOUT(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PT_AGC_TIMEOUT_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PT_AGC_TIMEOUT_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PT_COND_SIG_PRST_EN_MASK (0x10000U)
#define XCVR_2P4GHZ_PHY_FSK_PT_COND_SIG_PRST_EN_SHIFT (16U)
/*! COND_SIG_PRST_EN - Enables special conditioning of signal detection;
 *  0b0..disable.
 *  0b1..enable.
 */
#define XCVR_2P4GHZ_PHY_FSK_PT_COND_SIG_PRST_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PT_COND_SIG_PRST_EN_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PT_COND_SIG_PRST_EN_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PT_COND_AA_BUFF_EN_MASK (0x20000U)
#define XCVR_2P4GHZ_PHY_FSK_PT_COND_AA_BUFF_EN_SHIFT (17U)
/*! COND_AA_BUFF_EN - Enables special condition for enabling AA detector buffer;
 *  0b0..disable.
 *  0b1..enable.
 */
#define XCVR_2P4GHZ_PHY_FSK_PT_COND_AA_BUFF_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PT_COND_AA_BUFF_EN_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PT_COND_AA_BUFF_EN_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PT_BYPASS_WITH_RSSI_MASK (0x40000U)
#define XCVR_2P4GHZ_PHY_FSK_PT_BYPASS_WITH_RSSI_SHIFT (18U)
/*! BYPASS_WITH_RSSI - Bypass signal power measurement with RSSI measurement;
 *  0b0..no
 *  0b1..yes
 */
#define XCVR_2P4GHZ_PHY_FSK_PT_BYPASS_WITH_RSSI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PT_BYPASS_WITH_RSSI_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PT_BYPASS_WITH_RSSI_MASK)
#define XCVR_2P4GHZ_PHY_FSK_PT_POW_TH_BYPASS_MASK (0x80000U)
#define XCVR_2P4GHZ_PHY_FSK_PT_POW_TH_BYPASS_SHIFT (19U)
/*! POW_TH_BYPASS - Bypass power threshold when AGC gain are not set max;
 *  0b0..no bypass
 *  0b1..yes bypass
 */
#define XCVR_2P4GHZ_PHY_FSK_PT_POW_TH_BYPASS(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_PT_POW_TH_BYPASS_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_PT_POW_TH_BYPASS_MASK)
/*! @} */

/*! @name FSK_FAD_CTRL - PHY Uncoded FAD Control */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_FAD_CTRL_FAD_EN_MASK (0x1U)
#define XCVR_2P4GHZ_PHY_FSK_FAD_CTRL_FAD_EN_SHIFT (0U)
/*! FAD_EN - Enables FAD;
 *  0b0..disable.
 *  0b1..enable.
 */
#define XCVR_2P4GHZ_PHY_FSK_FAD_CTRL_FAD_EN(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_FAD_CTRL_FAD_EN_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_FAD_CTRL_FAD_EN_MASK)
/*! @} */

/*! @name FSK_FAD_CFG - PHY Uncoded FAD Config */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_WAIT_SYNCH_MASK (0x7FU)
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_WAIT_SYNCH_SHIFT (0U)
/*! WIN_FAD_WAIT_SYNCH - Time-window to wait for clean samples, before transitioning to AA search
 *    PHY state, if PD was found after antenna switch (refered to as T3 in the PHY state-machine
 *    section).
 */
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_WAIT_SYNCH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_WAIT_SYNCH_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_WAIT_SYNCH_MASK)
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_WAIT_PD_MASK (0x7F00U)
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_WAIT_PD_SHIFT (8U)
/*! WIN_FAD_WAIT_PD - Time-window to wait for clean samples if PD was not found after antenna switch
 *    (refered to as T2 in the PHY state-machine section).
 */
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_WAIT_PD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_WAIT_PD_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_WAIT_PD_MASK)
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_SEARCH_PD_MASK (0x7F0000U)
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_SEARCH_PD_SHIFT (16U)
/*! WIN_FAD_SEARCH_PD - Time-window to match preamble pattern on samples coming from the previously
 *    selected antenna (refered to as T1 in the PHY state-machine section).
 */
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_SEARCH_PD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_SEARCH_PD_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_FAD_SEARCH_PD_MASK)
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_SEARCH_PD_MASK (0x7F000000U)
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_SEARCH_PD_SHIFT (24U)
/*! WIN_SEARCH_PD - Time-window to match preamble pattern on samples coming from the currently
 *    selected antenna (refered to as T0 in the PHY state-machine section).
 */
#define XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_SEARCH_PD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_SEARCH_PD_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_FAD_CFG_WIN_SEARCH_PD_MASK)
/*! @} */

/*! @name FSK_STAT - PHY Uncoded Status */
/*! @{ */
#define XCVR_2P4GHZ_PHY_FSK_STAT_EXT_TO_MODES_13_MASK (0x2U)
#define XCVR_2P4GHZ_PHY_FSK_STAT_EXT_TO_MODES_13_SHIFT (1U)
/*! EXT_TO_MODES_13 - Reserved
 */
#define XCVR_2P4GHZ_PHY_FSK_STAT_EXT_TO_MODES_13(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_STAT_EXT_TO_MODES_13_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_STAT_EXT_TO_MODES_13_MASK)
#define XCVR_2P4GHZ_PHY_FSK_STAT_AA_FOUND_MASK   (0x4U)
#define XCVR_2P4GHZ_PHY_FSK_STAT_AA_FOUND_SHIFT  (2U)
/*! AA_FOUND - Indicates that a uncoded AA detect is active.
 */
#define XCVR_2P4GHZ_PHY_FSK_STAT_AA_FOUND(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_STAT_AA_FOUND_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_STAT_AA_FOUND_MASK)
#define XCVR_2P4GHZ_PHY_FSK_STAT_LAST_AA_BIT_MASK (0x8U)
#define XCVR_2P4GHZ_PHY_FSK_STAT_LAST_AA_BIT_SHIFT (3U)
/*! LAST_AA_BIT - reserved
 */
#define XCVR_2P4GHZ_PHY_FSK_STAT_LAST_AA_BIT(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_STAT_LAST_AA_BIT_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_STAT_LAST_AA_BIT_MASK)
#define XCVR_2P4GHZ_PHY_FSK_STAT_AA_MATCH_MASK   (0xF0U)
#define XCVR_2P4GHZ_PHY_FSK_STAT_AA_MATCH_SHIFT  (4U)
/*! AA_MATCH - Indicates which non-coded AA has matched. This will clear when the PHY is re-initialized.
 */
#define XCVR_2P4GHZ_PHY_FSK_STAT_AA_MATCH(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_STAT_AA_MATCH_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_STAT_AA_MATCH_MASK)
#define XCVR_2P4GHZ_PHY_FSK_STAT_HAMM_DIST_MASK  (0x7F00U)
#define XCVR_2P4GHZ_PHY_FSK_STAT_HAMM_DIST_SHIFT (8U)
/*! HAMM_DIST - Indicates the hamming distance witnessed when AA match occurred.
 */
#define XCVR_2P4GHZ_PHY_FSK_STAT_HAMM_DIST(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_STAT_HAMM_DIST_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_STAT_HAMM_DIST_MASK)
#define XCVR_2P4GHZ_PHY_FSK_STAT_CORR_MAX_MASK   (0x1F0000U)
#define XCVR_2P4GHZ_PHY_FSK_STAT_CORR_MAX_SHIFT  (16U)
/*! CORR_MAX - Indicates the correlation witnessed when AA match occurred
 */
#define XCVR_2P4GHZ_PHY_FSK_STAT_CORR_MAX(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_STAT_CORR_MAX_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_STAT_CORR_MAX_MASK)
#define XCVR_2P4GHZ_PHY_FSK_STAT_TOF_OFF_MASK    (0xF0000000U)
#define XCVR_2P4GHZ_PHY_FSK_STAT_TOF_OFF_SHIFT   (28U)
/*! TOF_OFF - Timing offset for use in time-of-flight calculation.
 */
#define XCVR_2P4GHZ_PHY_FSK_STAT_TOF_OFF(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_FSK_STAT_TOF_OFF_SHIFT)) & XCVR_2P4GHZ_PHY_FSK_STAT_TOF_OFF_MASK)
/*! @} */

