MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKW38A512VFT4/mcu.h
/*! @name STAT1 - PHY Status 1 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_STAT1_AA_BITS_MASK       (0xFFFFFFFFU)
#define XCVR_2P4GHZ_PHY_STAT1_AA_BITS_SHIFT      (0U)
/*! AA_BITS - AA bits either received or programed
 */
#define XCVR_2P4GHZ_PHY_STAT1_AA_BITS(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT1_AA_BITS_SHIFT)) & XCVR_2P4GHZ_PHY_STAT1_AA_BITS_MASK)
/*! @} */

/*! @name STAT2 - PHY Status 2 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_STAT2_CNT_ANT_SW_MASK    (0x3U)
#define XCVR_2P4GHZ_PHY_STAT2_CNT_ANT_SW_SHIFT   (0U)
/*! CNT_ANT_SW - Count of uncoded ANT switch event when FAD was enabled.
 */
#define XCVR_2P4GHZ_PHY_STAT2_CNT_ANT_SW(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT2_CNT_ANT_SW_SHIFT)) & XCVR_2P4GHZ_PHY_STAT2_CNT_ANT_SW_MASK)
#define XCVR_2P4GHZ_PHY_STAT2_CNT_UNCAA_TIMEOUT_MASK (0xCU)
#define XCVR_2P4GHZ_PHY_STAT2_CNT_UNCAA_TIMEOUT_SHIFT (2U)
/*! CNT_UNCAA_TIMEOUT - Count of uncoded AA search timeout event
 */
#define XCVR_2P4GHZ_PHY_STAT2_CNT_UNCAA_TIMEOUT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT2_CNT_UNCAA_TIMEOUT_SHIFT)) & XCVR_2P4GHZ_PHY_STAT2_CNT_UNCAA_TIMEOUT_MASK)
#define XCVR_2P4GHZ_PHY_STAT2_CNT_LRAA_TIMEOUT_MASK (0x30U)
#define XCVR_2P4GHZ_PHY_STAT2_CNT_LRAA_TIMEOUT_SHIFT (4U)
/*! CNT_LRAA_TIMEOUT - Count of lang range AA search timeout event
 */
#define XCVR_2P4GHZ_PHY_STAT2_CNT_LRAA_TIMEOUT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT2_CNT_LRAA_TIMEOUT_SHIFT)) & XCVR_2P4GHZ_PHY_STAT2_CNT_LRAA_TIMEOUT_MASK)
#define XCVR_2P4GHZ_PHY_STAT2_CNT_AACI_TIMEOUT_MASK (0xC0U)
#define XCVR_2P4GHZ_PHY_STAT2_CNT_AACI_TIMEOUT_SHIFT (6U)
/*! CNT_AACI_TIMEOUT - Count of long range AACI detect timeout event
 */
#define XCVR_2P4GHZ_PHY_STAT2_CNT_AACI_TIMEOUT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT2_CNT_AACI_TIMEOUT_SHIFT)) & XCVR_2P4GHZ_PHY_STAT2_CNT_AACI_TIMEOUT_MASK)
#define XCVR_2P4GHZ_PHY_STAT2_CNT_AGC_RST_MASK   (0x300U)
#define XCVR_2P4GHZ_PHY_STAT2_CNT_AGC_RST_SHIFT  (8U)
/*! CNT_AGC_RST - Count of AGC soft reset event
 */
#define XCVR_2P4GHZ_PHY_STAT2_CNT_AGC_RST(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_STAT2_CNT_AGC_RST_SHIFT)) & XCVR_2P4GHZ_PHY_STAT2_CNT_AGC_RST_MASK)
/*! @} */

/*! @name PREPHY_MISC - PHY PrePHY Misc Config */
/*! @{ */
#define XCVR_2P4GHZ_PHY_PREPHY_MISC_BUFF_PTR_LR_MASK (0x1FU)
#define XCVR_2P4GHZ_PHY_PREPHY_MISC_BUFF_PTR_LR_SHIFT (0U)
/*! BUFF_PTR_LR - Pointer to the PrePHY IQ buffer for the reception of the long-range packets.
 */
#define XCVR_2P4GHZ_PHY_PREPHY_MISC_BUFF_PTR_LR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_PREPHY_MISC_BUFF_PTR_LR_SHIFT)) & XCVR_2P4GHZ_PHY_PREPHY_MISC_BUFF_PTR_LR_MASK)
#define XCVR_2P4GHZ_PHY_PREPHY_MISC_BUFF_PTR_GFSK_MASK (0x1F00U)
#define XCVR_2P4GHZ_PHY_PREPHY_MISC_BUFF_PTR_GFSK_SHIFT (8U)
/*! BUFF_PTR_GFSK - Pointer to the PrePHY IQ buffer for the reception of the uncoded packets.
 */
#define XCVR_2P4GHZ_PHY_PREPHY_MISC_BUFF_PTR_GFSK(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_PREPHY_MISC_BUFF_PTR_GFSK_SHIFT)) & XCVR_2P4GHZ_PHY_PREPHY_MISC_BUFF_PTR_GFSK_MASK)
/*! @} */

/*! @name DMD_CTRL0 - PHY Demodulator Control 0 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_TED_ACT_WIN_MASK (0x3U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_TED_ACT_WIN_SHIFT (0U)
/*! TED_ACT_WIN - Active window size for the time tracking mechanism, expressed in symbols.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_TED_ACT_WIN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL0_TED_ACT_WIN_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL0_TED_ACT_WIN_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_FED_ACT_WIN_MASK (0x300U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_FED_ACT_WIN_SHIFT (8U)
/*! FED_ACT_WIN - Active window size for the frequency tracking mechanism, expressed in symbols.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_FED_ACT_WIN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL0_FED_ACT_WIN_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL0_FED_ACT_WIN_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_DREP_SCALE_FREQ_MASK (0xF0000U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_DREP_SCALE_FREQ_SHIFT (16U)
/*! DREP_SCALE_FREQ - Frequency domain signal scaling factor used by the de-repeater.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_DREP_SCALE_FREQ(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL0_DREP_SCALE_FREQ_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL0_DREP_SCALE_FREQ_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_REPEAT_FACTOR_MASK (0x700000U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_REPEAT_FACTOR_SHIFT (20U)
/*! REPEAT_FACTOR - Repetition factor used by the de-repeater.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_REPEAT_FACTOR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL0_REPEAT_FACTOR_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL0_REPEAT_FACTOR_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_TERR_TRK_EN_MASK (0x4000000U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_TERR_TRK_EN_SHIFT (26U)
/*! TERR_TRK_EN - Enables time tracking in the demodulator.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_TERR_TRK_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL0_TERR_TRK_EN_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL0_TERR_TRK_EN_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_FERR_TRK_EN_MASK (0x8000000U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_FERR_TRK_EN_SHIFT (27U)
/*! FERR_TRK_EN - Enables frequency tracking in the demodulator.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_FERR_TRK_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL0_FERR_TRK_EN_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL0_FERR_TRK_EN_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_DREP_SINE_EN_MASK (0x10000000U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_DREP_SINE_EN_SHIFT (28U)
/*! DREP_SINE_EN - Flag used to enable the non-linear operation in the de-repeater.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_DREP_SINE_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL0_DREP_SINE_EN_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL0_DREP_SINE_EN_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_DEMOD_MOD_MASK (0x60000000U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_DEMOD_MOD_SHIFT (29U)
/*! DEMOD_MOD - Determines the number of taps used by the demodulator correlators;
 *  0b00..use 12 taps
 *  0b01..use 4 taps
 *  0b10..use 7 taps
 *  0b11..use 13 taps
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL0_DEMOD_MOD(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL0_DEMOD_MOD_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL0_DEMOD_MOD_MASK)
/*! @} */

/*! @name DMD_CTRL1 - PHY Dmodulator Control 1 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_FED_IDLE_WIN_MASK (0x3FFU)
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_FED_IDLE_WIN_SHIFT (0U)
/*! FED_IDLE_WIN - Idle window size for the frequency tracking mechanism, expressed in symbols.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_FED_IDLE_WIN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL1_FED_IDLE_WIN_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL1_FED_IDLE_WIN_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_ERR_SCALE_MASK (0x3C00U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_ERR_SCALE_SHIFT (10U)
/*! TED_ERR_SCALE - Scaling factor used by the time tracking loop.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_ERR_SCALE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_ERR_SCALE_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_ERR_SCALE_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_FED_IMM_MEAS_EN_MASK (0x8000U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_FED_IMM_MEAS_EN_SHIFT (15U)
/*! FED_IMM_MEAS_EN - Specifies whether the frequency tracking starts with an active window;
 *  0b0..start with idle window
 *  0b1..start with active window
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_FED_IMM_MEAS_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL1_FED_IMM_MEAS_EN_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL1_FED_IMM_MEAS_EN_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_IDLE_WIN_MASK (0x3FF0000U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_IDLE_WIN_SHIFT (16U)
/*! TED_IDLE_WIN - Idle window size for the time tracking mechanism, expressed in symbols.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_IDLE_WIN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_IDLE_WIN_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_IDLE_WIN_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TTRK_INT_RANGE_MASK (0x3C000000U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TTRK_INT_RANGE_SHIFT (26U)
/*! TTRK_INT_RANGE - Timing error correction interpolation range, expressed in samples. The value must equal or bigger than 1.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TTRK_INT_RANGE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL1_TTRK_INT_RANGE_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL1_TTRK_INT_RANGE_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_IMM_MEAS_EN_MASK (0x80000000U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_IMM_MEAS_EN_SHIFT (31U)
/*! TED_IMM_MEAS_EN - Specifies whether the time tracking starts with an active window;
 *  0b0..start with idle window
 *  0b1..start with active window
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_IMM_MEAS_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_IMM_MEAS_EN_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL1_TED_IMM_MEAS_EN_MASK)
/*! @} */

/*! @name DMD_CTRL2 - PHY Demodulator Control 2 */
/*! @{ */
#define XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_DMD_LR_ADJ_MASK (0xFU)
#define XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_DMD_LR_ADJ_SHIFT (0U)
/*! WAIT_DMD_LR_ADJ - Reserved. Must be programed as reset value 1.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_DMD_LR_ADJ(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_DMD_LR_ADJ_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_DMD_LR_ADJ_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_VIA_AFTER_AA_ADJ_MASK (0xF0U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_VIA_AFTER_AA_ADJ_SHIFT (4U)
/*! WAIT_VIA_AFTER_AA_ADJ - Reserved. Must be programed as reset value 1.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_VIA_AFTER_AA_ADJ(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_VIA_AFTER_AA_ADJ_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_VIA_AFTER_AA_ADJ_MASK)
#define XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_DMD_CLKEN_ADJ_MASK (0xF00U)
#define XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_DMD_CLKEN_ADJ_SHIFT (8U)
/*! WAIT_DMD_CLKEN_ADJ - Reserved. Must be programed as reset value 1.
 */
#define XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_DMD_CLKEN_ADJ(x) (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_DMD_CLKEN_ADJ_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_CTRL2_WAIT_DMD_CLKEN_ADJ_MASK)
/*! @} */

/*! @name DMD_WAVE_REG0 -  */
/*! @{ */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL0_MASK (0x3FU)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL0_SHIFT (0U)
/*! SMPL0 - Demodulator waveform 7 sample 0 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL0(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL0_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL0_MASK)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL1_MASK (0xFC0U)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL1_SHIFT (6U)
/*! SMPL1 - Demodulator waveform 7 sample 1 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL1(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL1_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL1_MASK)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL2_MASK (0x3F000U)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL2_SHIFT (12U)
/*! SMPL2 - Demodulator waveform 7 sample 2 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL2(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL2_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL2_MASK)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL3_MASK (0xFC0000U)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL3_SHIFT (18U)
/*! SMPL3 - Demodulator waveform 7 sample 3 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL3(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL3_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL3_MASK)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL4_MASK (0x3F000000U)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL4_SHIFT (24U)
/*! SMPL4 - Demodulator waveform 7 sample 4 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL4(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL4_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_SMPL4_MASK)
/*! @} */

/* The count of XCVR_2P4GHZ_PHY_DMD_WAVE_REG0 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG0_COUNT      (8U)

/*! @name DMD_WAVE_REG1 -  */
/*! @{ */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL5_MASK (0x3FU)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL5_SHIFT (0U)
/*! SMPL5 - Demodulator waveform 7 sample 5 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL5(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL5_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL5_MASK)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL6_MASK (0xFC0U)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL6_SHIFT (6U)
/*! SMPL6 - Demodulator waveform 7 sample 6 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL6(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL6_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL6_MASK)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL7_MASK (0x3F000U)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL7_SHIFT (12U)
/*! SMPL7 - Demodulator waveform 7 sample 7 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL7(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL7_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL7_MASK)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL8_MASK (0xFC0000U)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL8_SHIFT (18U)
/*! SMPL8 - Demodulator waveform 7 sample 8 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL8(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL8_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL8_MASK)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL9_MASK (0x3F000000U)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL9_SHIFT (24U)
/*! SMPL9 - Demodulator waveform 7 sample 9 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL9(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL9_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_SMPL9_MASK)
/*! @} */

/* The count of XCVR_2P4GHZ_PHY_DMD_WAVE_REG1 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG1_COUNT      (8U)

/*! @name DMD_WAVE_REG2 -  */
/*! @{ */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL10_MASK (0x3FU)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL10_SHIFT (0U)
/*! SMPL10 - Demodulator waveform 7 sample 10 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL10(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL10_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL10_MASK)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL11_MASK (0xFC0U)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL11_SHIFT (6U)
/*! SMPL11 - Demodulator waveform 7 sample 11 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL11(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL11_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL11_MASK)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL12_MASK (0x3F000U)
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL12_SHIFT (12U)
/*! SMPL12 - Demodulator waveform 7 sample 12 (sfix6en5)
 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL12(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL12_SHIFT)) & XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_SMPL12_MASK)
/*! @} */

/* The count of XCVR_2P4GHZ_PHY_DMD_WAVE_REG2 */
#define XCVR_2P4GHZ_PHY_DMD_WAVE_REG2_COUNT      (8U)


/*!
 * @}
 */ /* end of group XCVR_2P4GHZ_PHY_Register_Masks */


/* XCVR_2P4GHZ_PHY - Peripheral instance base addresses */
/** Peripheral XCVR_2P4GHZ_PHY base address */
#define XCVR_2P4GHZ_PHY_BASE                     (0x40087800u)
/** Peripheral XCVR_2P4GHZ_PHY base pointer */
#define XCVR_2P4GHZ_PHY                          ((XCVR_2P4GHZ_PHY_Type *)XCVR_2P4GHZ_PHY_BASE)
/** Array initializer of XCVR_2P4GHZ_PHY peripheral base addresses */
#define XCVR_2P4GHZ_PHY_BASE_ADDRS               { XCVR_2P4GHZ_PHY_BASE }
/** Array initializer of XCVR_2P4GHZ_PHY peripheral base pointers */
#define XCVR_2P4GHZ_PHY_BASE_PTRS                { XCVR_2P4GHZ_PHY }

/*!
 * @}
 */ /* end of group XCVR_2P4GHZ_PHY_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- XCVR_ANALOG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XCVR_ANALOG_Peripheral_Access_Layer XCVR_ANALOG Peripheral Access Layer
 * @{
 */

/** XCVR_ANALOG - Register Layout Typedef */
typedef struct {
  __IO uint32_t BB_LDO_1;                          /**< RF Analog Baseband LDO Control 1, offset: 0x0 */
  __IO uint32_t BB_LDO_2;                          /**< RF Analog Baseband LDO Control 2, offset: 0x4 */
  __IO uint32_t RX_ADC;                            /**< RF Analog ADC Control, offset: 0x8 */
  __IO uint32_t RX_BBA;                            /**< RF Analog BBA Control, offset: 0xC */
  __IO uint32_t RX_LNA;                            /**< RF Analog LNA Control, offset: 0x10 */
  __IO uint32_t RX_TZA;                            /**< RF Analog TZA Control, offset: 0x14 */
  __IO uint32_t RX_AUXPLL;                         /**< RF Analog Aux PLL Control, offset: 0x18 */
  __IO uint32_t SY_CTRL_1;                         /**< RF Analog Synthesizer Control 1, offset: 0x1C */
  __IO uint32_t SY_CTRL_2;                         /**< RF Analog Synthesizer Control 2, offset: 0x20 */
  __IO uint32_t TX_DAC_PA;                         /**< RF Analog TX HPM DAC and PA Control, offset: 0x24 */
} XCVR_ANALOG_Type;

/* ----------------------------------------------------------------------------
   -- XCVR_ANALOG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XCVR_ANALOG_Register_Masks XCVR_ANALOG Register Masks
 * @{
 */

