MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKW38A512VFT4/mcu.h
/*! @name LPM_SDM_RES2 - PLL Low Port Sigma Delta Result 2 */
/*! @{ */
#define XCVR_PLL_DIG_LPM_SDM_RES2_LPM_DENOM_SELECTED_MASK (0xFFFFFFFU)
#define XCVR_PLL_DIG_LPM_SDM_RES2_LPM_DENOM_SELECTED_SHIFT (0U)
/*! LPM_DENOM_SELECTED - Low Port Modulation Denominator Selected
 */
#define XCVR_PLL_DIG_LPM_SDM_RES2_LPM_DENOM_SELECTED(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_LPM_SDM_RES2_LPM_DENOM_SELECTED_SHIFT)) & XCVR_PLL_DIG_LPM_SDM_RES2_LPM_DENOM_SELECTED_MASK)
/*! @} */

/*! @name DELAY_MATCH - PLL Delay Matching */
/*! @{ */
#define XCVR_PLL_DIG_DELAY_MATCH_LPM_SDM_DELAY_MASK (0xFU)
#define XCVR_PLL_DIG_DELAY_MATCH_LPM_SDM_DELAY_SHIFT (0U)
/*! LPM_SDM_DELAY - Low Port SDM Delay Matching
 */
#define XCVR_PLL_DIG_DELAY_MATCH_LPM_SDM_DELAY(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_DELAY_MATCH_LPM_SDM_DELAY_SHIFT)) & XCVR_PLL_DIG_DELAY_MATCH_LPM_SDM_DELAY_MASK)
#define XCVR_PLL_DIG_DELAY_MATCH_HPM_SDM_DELAY_MASK (0xF00U)
#define XCVR_PLL_DIG_DELAY_MATCH_HPM_SDM_DELAY_SHIFT (8U)
/*! HPM_SDM_DELAY - High Port SDM Delay Matching
 */
#define XCVR_PLL_DIG_DELAY_MATCH_HPM_SDM_DELAY(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_DELAY_MATCH_HPM_SDM_DELAY_SHIFT)) & XCVR_PLL_DIG_DELAY_MATCH_HPM_SDM_DELAY_MASK)
#define XCVR_PLL_DIG_DELAY_MATCH_HPM_INTEGER_DELAY_MASK (0xF0000U)
#define XCVR_PLL_DIG_DELAY_MATCH_HPM_INTEGER_DELAY_SHIFT (16U)
/*! HPM_INTEGER_DELAY - High Port Integer Delay Matching
 */
#define XCVR_PLL_DIG_DELAY_MATCH_HPM_INTEGER_DELAY(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_DELAY_MATCH_HPM_INTEGER_DELAY_SHIFT)) & XCVR_PLL_DIG_DELAY_MATCH_HPM_INTEGER_DELAY_MASK)
/*! @} */

/*! @name BALUN_TX - Balun Tuning Cap Settings in Transmit Mode */
/*! @{ */
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_0_MASK (0x7U)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_0_SHIFT (0U)
/*! TUNING_RANGE_0 - Tuning Range 0
 */
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_0(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_0_SHIFT)) & XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_0_MASK)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_1_MASK (0x38U)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_1_SHIFT (3U)
/*! TUNING_RANGE_1 - Tuning Range 1
 */
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_1(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_1_SHIFT)) & XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_1_MASK)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_2_MASK (0x1C0U)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_2_SHIFT (6U)
/*! TUNING_RANGE_2 - Tuning Range 2
 */
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_2(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_2_SHIFT)) & XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_2_MASK)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_3_MASK (0xE00U)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_3_SHIFT (9U)
/*! TUNING_RANGE_3 - Tuning Range 3
 */
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_3(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_3_SHIFT)) & XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_3_MASK)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_4_MASK (0x7000U)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_4_SHIFT (12U)
/*! TUNING_RANGE_4 - Tuning Range 4
 */
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_4(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_4_SHIFT)) & XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_4_MASK)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_5_MASK (0x38000U)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_5_SHIFT (15U)
/*! TUNING_RANGE_5 - Tuning Range 5
 */
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_5(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_5_SHIFT)) & XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_5_MASK)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_6_MASK (0x1C0000U)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_6_SHIFT (18U)
/*! TUNING_RANGE_6 - Tuning Range 6
 */
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_6(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_6_SHIFT)) & XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_6_MASK)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_7_MASK (0xE00000U)
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_7_SHIFT (21U)
/*! TUNING_RANGE_7 - Tuning Range 7
 */
#define XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_7(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_7_SHIFT)) & XCVR_PLL_DIG_BALUN_TX_TUNING_RANGE_7_MASK)
/*! @} */

/*! @name BALUN_RX - Balun Tuning Cap Settings in Receive Mode */
/*! @{ */
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_0_MASK (0x7U)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_0_SHIFT (0U)
/*! TUNING_RANGE_0 - Tuning Range 0
 */
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_0(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_0_SHIFT)) & XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_0_MASK)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_1_MASK (0x38U)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_1_SHIFT (3U)
/*! TUNING_RANGE_1 - Tuning Range 1
 */
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_1(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_1_SHIFT)) & XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_1_MASK)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_2_MASK (0x1C0U)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_2_SHIFT (6U)
/*! TUNING_RANGE_2 - Tuning Range 2
 */
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_2(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_2_SHIFT)) & XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_2_MASK)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_3_MASK (0xE00U)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_3_SHIFT (9U)
/*! TUNING_RANGE_3 - Tuning Range 3
 */
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_3(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_3_SHIFT)) & XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_3_MASK)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_4_MASK (0x7000U)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_4_SHIFT (12U)
/*! TUNING_RANGE_4 - Tuning Range 4
 */
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_4(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_4_SHIFT)) & XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_4_MASK)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_5_MASK (0x38000U)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_5_SHIFT (15U)
/*! TUNING_RANGE_5 - Tuning Range 5
 */
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_5(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_5_SHIFT)) & XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_5_MASK)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_6_MASK (0x1C0000U)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_6_SHIFT (18U)
/*! TUNING_RANGE_6 - Tuning Range 6
 */
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_6(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_6_SHIFT)) & XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_6_MASK)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_7_MASK (0xE00000U)
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_7_SHIFT (21U)
/*! TUNING_RANGE_7 - Tuning Range 7
 */
#define XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_7(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_7_SHIFT)) & XCVR_PLL_DIG_BALUN_RX_TUNING_RANGE_7_MASK)
/*! @} */

/*! @name MAX_TX_CFG1_FREQ - Max Transmit Frequency For TX Configuration 1 */
/*! @{ */
#define XCVR_PLL_DIG_MAX_TX_CFG1_FREQ_MAX_TX_CFG1_FREQ_MASK (0xFFFU)
#define XCVR_PLL_DIG_MAX_TX_CFG1_FREQ_MAX_TX_CFG1_FREQ_SHIFT (0U)
/*! MAX_TX_CFG1_FREQ - Maximum Transmit Frequency for Standard TX Settings
 */
#define XCVR_PLL_DIG_MAX_TX_CFG1_FREQ_MAX_TX_CFG1_FREQ(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_MAX_TX_CFG1_FREQ_MAX_TX_CFG1_FREQ_SHIFT)) & XCVR_PLL_DIG_MAX_TX_CFG1_FREQ_MAX_TX_CFG1_FREQ_MASK)
/*! @} */

/*! @name CTUNE_CTRL - PLL Coarse Tune Control */
/*! @{ */
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_MANUAL_MASK (0xFFFU)
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_MANUAL_SHIFT (0U)
/*! CTUNE_TARGET_MANUAL - Manual Coarse Tune Target
 */
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_MANUAL(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_MANUAL_SHIFT)) & XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_MANUAL_MASK)
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_DISABLE_MASK (0x8000U)
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_DISABLE_SHIFT (15U)
/*! CTUNE_TARGET_DISABLE - Disable Coarse Tune Target
 */
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_DISABLE_SHIFT)) & XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_DISABLE_MASK)
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_ADJUST_MASK (0xF0000U)
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_ADJUST_SHIFT (16U)
/*! CTUNE_ADJUST - Coarse Tune Count Adjustment
 */
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_ADJUST(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_ADJUST_SHIFT)) & XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_ADJUST_MASK)
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_MANUAL_MASK (0x7F00000U)
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_MANUAL_SHIFT (20U)
/*! CTUNE_MANUAL - Manual Coarse Tune Setting
 */
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_MANUAL(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_MANUAL_SHIFT)) & XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_MANUAL_MASK)
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_DISABLE_MASK (0x80000000U)
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_DISABLE_SHIFT (31U)
/*! CTUNE_DISABLE - Coarse Tune Disable
 */
#define XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_DISABLE_SHIFT)) & XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_DISABLE_MASK)
/*! @} */

/*! @name DATA_RATE_OVRD_CTRL1 - PLL Data Rate Override Control */
/*! @{ */
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_CAL_SCALE_CFG1_MASK (0xFU)
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_CAL_SCALE_CFG1_SHIFT (0U)
/*! HPM_CAL_SCALE_CFG1 - HPM Scale Configuration1
 */
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_CAL_SCALE_CFG1(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_CAL_SCALE_CFG1_SHIFT)) & XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_CAL_SCALE_CFG1_MASK)
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_LPM_SCALE_CFG1_MASK (0xF0U)
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_LPM_SCALE_CFG1_SHIFT (4U)
/*! LPM_SCALE_CFG1 - LPM Scale Configuration1
 */
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_LPM_SCALE_CFG1(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_LPM_SCALE_CFG1_SHIFT)) & XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_LPM_SCALE_CFG1_MASK)
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_FDB_RES_CAL_CFG1_MASK (0x300U)
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_FDB_RES_CAL_CFG1_SHIFT (8U)
/*! HPM_FDB_RES_CAL_CFG1 - HPM FDB RES Calibration Configuration1
 */
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_FDB_RES_CAL_CFG1(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_FDB_RES_CAL_CFG1_SHIFT)) & XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_FDB_RES_CAL_CFG1_MASK)
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_FDB_RES_TX_CFG1_MASK (0xC00U)
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_FDB_RES_TX_CFG1_SHIFT (10U)
/*! HPM_FDB_RES_TX_CFG1 - HPM FDB RES Transmit Configuration1
 */
#define XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_FDB_RES_TX_CFG1(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_FDB_RES_TX_CFG1_SHIFT)) & XCVR_PLL_DIG_DATA_RATE_OVRD_CTRL1_HPM_FDB_RES_TX_CFG1_MASK)
/*! @} */

/*! @name CTUNE_RES - PLL Coarse Tune Results */
/*! @{ */
#define XCVR_PLL_DIG_CTUNE_RES_CTUNE_SELECTED_MASK (0x7FU)
#define XCVR_PLL_DIG_CTUNE_RES_CTUNE_SELECTED_SHIFT (0U)
/*! CTUNE_SELECTED - Coarse Tune Setting to VCO
 */
#define XCVR_PLL_DIG_CTUNE_RES_CTUNE_SELECTED(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_CTUNE_RES_CTUNE_SELECTED_SHIFT)) & XCVR_PLL_DIG_CTUNE_RES_CTUNE_SELECTED_MASK)
#define XCVR_PLL_DIG_CTUNE_RES_CTUNE_BEST_DIFF_MASK (0x3FC00U)
#define XCVR_PLL_DIG_CTUNE_RES_CTUNE_BEST_DIFF_SHIFT (10U)
/*! CTUNE_BEST_DIFF - Coarse Tune Absolute Best Difference
 */
#define XCVR_PLL_DIG_CTUNE_RES_CTUNE_BEST_DIFF(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_CTUNE_RES_CTUNE_BEST_DIFF_SHIFT)) & XCVR_PLL_DIG_CTUNE_RES_CTUNE_BEST_DIFF_MASK)
#define XCVR_PLL_DIG_CTUNE_RES_CTUNE_FREQ_SELECTED_MASK (0x3FFC0000U)
#define XCVR_PLL_DIG_CTUNE_RES_CTUNE_FREQ_SELECTED_SHIFT (18U)
/*! CTUNE_FREQ_SELECTED - Coarse Tune Frequency Selected
 */
#define XCVR_PLL_DIG_CTUNE_RES_CTUNE_FREQ_SELECTED(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_CTUNE_RES_CTUNE_FREQ_SELECTED_SHIFT)) & XCVR_PLL_DIG_CTUNE_RES_CTUNE_FREQ_SELECTED_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group XCVR_PLL_DIG_Register_Masks */


